Attribute VB_Name = "ClassFactory"
Option Compare Database

' Accnt >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' формируем объект ~Задолженность~ по известному ключу такого объекта. 07.02.2023.
Public Function accntByKey(ByVal accntKey As Long, ByRef db As DAO.Database) As Accnt

    Dim accntNew As Accnt, boResult As Boolean
    
    Set accntNew = New Accnt

    ' реинициализируем объект *Стройка-Агент-Код* по известному ключу такого объекта
    accntNew.ReinitByAccntKey accntKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set accntByKey = accntNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set accntByKey = Nothing
    End If

End Function
' Accnt. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' Cn >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' формируем объект ~Задолженность~ по известному ключу такого объекта. 07.02.2023.
Public Function cnByKey(ByVal cnKey As Long, ByRef db As DAO.Database) As Cn

    Dim cnNew As Cn, boResult As Boolean
    
    Set cnNew = New Cn

    ' реинициализируем объект *Стройка-Агент-Код* по известному ключу такого объекта
    cnNew.ReinitByCnKey cnKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set cnByKey = cnNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set cnByKey = Nothing
    End If

End Function
' Cn. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' CnInv >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' создаём связь договора и нового счёта-фактуры по ключу договора, номеру и дате счёта-фактуры
Public Function cnInvCreateNewInvNew _
    (invNum As Variant, invDate As Variant, cnKey As Long, db As DAO.Database, strNote As String) As cnInv

    Dim cnInvNew As cnInv
    Set cnInvNew = New cnInv

    ' реинициализируем объект связи договора и нового счёта-фактуры на основе создания нового
    cnInvNew.riCnInvCreateNewInvNew invNum, invDate, cnKey, db, strNote
    Set cnInvCreateNewInvNew = cnInvNew

End Function

' создаём связь договора и нового счёта-фактуры по ключу договора и ключу счёта-фактуры. 25.10.2022 *************************************************
Public Function cnInvCreateNewInvCn(InvKey As Long, cnKey As Long, db As DAO.Database, strNote As String) As cnInv

    Dim cnInvNew As cnInv
    Set cnInvNew = New cnInv

    ' реинициализируем объект связи договора и нового счёта-фактуры на основе создания нового
    cnInvNew.riCnInvCreateNewInvCn InvKey, cnKey, db, strNote
    Set cnInvCreateNewInvCn = cnInvNew

End Function ' **************************************************************************************************************************************

' формируем объект связи договора и счёта-фактуры по известному ключу такого объекта
Public Function cnInvReadKey(cnInv As Long, db As DAO.Database) As cnInv

    Dim cnInvNew As cnInv, boResult As Boolean
    
    Set cnInvNew = New cnInv

    ' реинициализируем объект связи договора и нового счёта-фактуры по известному ключу такого объекта
    cnInvNew.riCnInvReadKey cnInv, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set cnInvReadKey = cnInvNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set cnInvReadKey = Nothing
    End If

End Function
' CnInv. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


' Cias >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' создаём объект ~Факт связи тройки (СФ+Д)+СГК+ОПСД~ через создание нового такого объекта по СФ+Д, СГК и ОПСД. 24.03.2022
Public Function ciasCreateNew(ciasCnInv As Long, ciasAccnt As Long, ciasCsos As Long, db As DAO.Database, strNote As String) As Cias

    Dim ciasNew As Cias
    Set ciasNew = New Cias

    ' реинициализируем объект ~Факт связи тройки (СФ+Д)+СГК+ОПСД~ через создание нового такого объекта по СФ+Д, СГК и ОПСД
    ciasNew.riCiasCreateNew ciasCnInv, ciasAccnt, ciasCsos, db, strNote
    Set ciasCreateNew = ciasNew

End Function

' формируем объект ~Факт связи тройки (СФ+Д)+СГК+ОПСД~ по известному ключу такого объекта. 07.02.2023.
Public Function ciasByKey(ByVal ciasKey As Long, ByRef db As DAO.Database) As Cias

    Dim ciasNew As Cias, boResult As Boolean
    
    Set ciasNew = New Cias

    ' реинициализируем объект *Стройка-Агент-Код* по известному ключу такого объекта
    ciasNew.ReinitByKey ciasKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ciasByKey = ciasNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ciasByKey = Nothing
    End If

End Function
' Cias. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' Cia >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' формируем объект ~Задолженность~ по известному ключу такого объекта. 06.02.2023.
Public Function ciaByKey(ByVal ciaKey As Long, ByRef db As DAO.Database) As Cia

    Dim ciaNew As Cia, boResult As Boolean
    
    Set ciaNew = New Cia

    ' реинициализируем объект *Стройка-Агент-Код* по известному ключу такого объекта
    ciaNew.ReinitialiseByKey ciaKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ciaByKey = ciaNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ciaByKey = Nothing
    End If

End Function
' Cia. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' CiaNm >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' формируем объект ~Задолженность с именем~ по известному ключу объекта ~Задолженность~. 06.02.2023.
Public Function ciaNmByCiaKey(ByVal ciaKey As Long, ByRef db As DAO.Database) As CiaNm

    Dim ciaNmNew As CiaNm, boResult As Boolean
    
    Set ciaNmNew = New CiaNm

    ' реинициализируем объект *Стройка-Агент-Код* по известному ключу такого объекта
    ciaNmNew.ReinitByCiaKey ciaKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ciaNmByCiaKey = ciaNmNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ciaNmByCiaKey = Nothing
    End If

End Function

' формируем объект ~Задолженность~ по ключу "Счёта-фактуры" и имени задолженности. 06.02.2023.
Public Function ciaNmByInvAndCiaName(ByVal iKey As Long, ByVal ciaName As String, ByRef db As DAO.Database) As CiaNm

    Dim ciaNmNew As CiaNm, boResult As Boolean
    
    Set ciaNmNew = New CiaNm

    ' реинициализируем объект *Стройка-Агент-Код* по известному ключу такого объекта
    ciaNmNew.ReinitByInvAndCiaName iKey, ciaName, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ciaNmByInvAndCiaName = ciaNmNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ciaNmByInvAndCiaName = Nothing
    End If

End Function
' CiaNm. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' Inv >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' формируем счёт-фактуру по известному ключу такого объекта. 06.02.2023.
Public Function invByKey(ByVal iKey As Long, ByRef db As DAO.Database) As Inv

    Dim invNew As Inv, boResult As Boolean
    
    Set invNew = New Inv

    ' реинициализируем объект *Стройка-Агент-Код* по известному ключу такого объекта
    invNew.ReinitialiseByKey iKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set invByKey = invNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set invByKey = Nothing
    End If

End Function

' создаём счёт-фактуру по номеру и дате
Public Function invCreateNewNumDate(invNum As Variant, invDate As Variant, db As DAO.Database, strNote As String) As Inv

    Dim invNew As Inv
    Set invNew = New Inv

    ' реинициализируем объект счёта-фактуры на основе создания нового по номеру и дате
    invNew.riInvCreateNewNumDate invNum, invDate, db, strNote
    Set invCreateNewNumDate = invNew

End Function

' создаём счёт-фактуру по дате. Здесь выходит заготовка, без номера.
Public Function invCreateNewDate(invDate As Variant, db As DAO.Database, strNote As String) As Inv

    Dim invNew As Inv
    Set invNew = New Inv

    ' реинициализируем объект счёта-фактуры на основе создания нового по дате
    invNew.riInvCreateNewDate invDate, db, strNote
    Set invCreateNewDate = invNew

End Function
' Inv. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' InvNum >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' создаём номер счёта-фактуры по дате и ключу счёта-фактуры
Public Function invNumCreateNew(invNum As Variant, InvKey As Long, db As DAO.Database, strNote As String) As invNum

    Dim invNumNew As invNum
    Set invNumNew = New invNum

    ' реинициализируем объект счёта-фактуры на основе создания нового по дате
    invNumNew.riInvNumCreateNewNum invNum, InvKey, db, strNote
    Set invNumCreateNew = invNumNew

End Function
' InvNum. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' prDoc >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' создаём объект ~первичный документ~ через создание нового такого объекта по четырём параметрам. 25.03.2022 ****************************************
Public Function prDocCreateNew(ByVal cnpdNum As String, ByVal cnpdDate As Date, ByVal cnpdTpOrd As Long, _
    ByVal cnpdCnInvAccntSmpl As Long, ByRef db As DAO.Database, ByVal strNote As String) As prDoc

    Dim prDocNew As prDoc
    Set prDocNew = New prDoc

    ' реинициализируем объект счёта-фактуры на основе создания нового по дате
    prDocNew.riPrDocCreateNew cnpdNum, cnpdDate, cnpdTpOrd, cnpdCnInvAccntSmpl, db, strNote
    Set prDocCreateNew = prDocNew

End Function
' создаём объект ~первичный документ~ через создание нового такого объекта по четырём параметрам. 28.03.2022. Окончание *****************************
' prDoc. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' prDocP >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Пункт первичного документа*
' ***************************************************************************************************************************************************
' инициализируем объект ~Пункт первичного документа~ по известному ключу такого объекта. 02.06.2023
' ...................................................................................................................................................
Public Function prDocPnByKey(ByVal prDocPnKey As Long, ByRef db As DAO.Database) As prDocPn

    Dim prDocPnNew As prDocPn, boResult As Boolean
    
    Set prDocPnNew = New prDocPn

    ' реинициализируем объект *Пункт первичного документа* по известному ключу такого объекта
    prDocPnNew.riByKey prDocPnKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set prDocPnByKey = prDocPnNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set prDocPnByKey = Nothing
    End If

End Function
' ...................................................................................................................................................
' инициализируем объект ~Пункт первичного документа~ по известному ключу такого объекта. 02.06.2023. Окончание
' ***************************************************************************************************************************************************

' ***************************************************************************************************************************************************
' создаём объект ~Пункт первичного документа~ через создание нового такого объекта по N параметрам. 25.03.2022
' ...................................................................................................................................................
Public Function prDocPnCreateNew(ByVal pdpPrDoc As Long, ByVal pdpCstAgPn As Long, ByVal StatusOfDICtext As String _
    , ByVal satstusOfOUKVtext As String, ByVal summ As Currency, ByVal cost As Currency, ByVal SumTax As Currency, ByVal costVAT As Currency _
    , ByVal SPPelement As String, ByVal docOfAccountNum As String _
    , ByVal AccountDate As Variant, ByVal positingDate As Variant _
    , ByVal accountingDoc As String, ByVal agent As Variant, ByVal TextOfAgent As Variant _
    , ByVal prjctDefinition As String, ByVal prjctDefinitionSort As String, ByVal prjctHierarchyLevel As Long _
    , ByVal ParentSppElementNum As Variant, ByVal Object As Variant _
    , ByVal cstDSW As Variant, ByVal raNum As Variant, ByVal raDate As Variant, ByVal CorrectionNum As Variant _
    , ByVal CorrectionDate As Variant _
    , ByVal accountingDocName As Variant _
    , ByVal purchasingGroup As Variant, ByVal purchasingGroupName As Variant, ByVal pdpNote As String, db As DAO.Database) As prDocPn

    Dim prDocPnNew As prDocPn
    Set prDocPnNew = New prDocPn

    ' реинициализируем объект счёта-фактуры на основе создания нового по дате
    prDocPnNew.riPrDocPnCreateNew pdpPrDoc, pdpCstAgPn, StatusOfDICtext, satstusOfOUKVtext, summ, cost, SumTax, costVAT, _
        SPPelement, docOfAccountNum, AccountDate, positingDate, accountingDoc, agent, TextOfAgent, _
        prjctDefinition, prjctDefinitionSort, prjctHierarchyLevel, ParentSppElementNum, Object, cstDSW, raNum, raDate, _
        CorrectionNum, CorrectionDate, accountingDocName, purchasingGroup, purchasingGroupName, pdpNote, db
    Set prDocPnCreateNew = prDocPnNew

End Function
' ...................................................................................................................................................
' создаём объект ~Пункт первичного документа~ через создание нового такого объекта по N параметрам. 28.03.2022. Окончание
' ***************************************************************************************************************************************************
' класс *Пункт первичного документа*
' prDocP. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' cst >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Стройка*. 26.07.2023
' ***************************************************************************************************************************************************
' формируем новый объект *Стройка* по имени такого объекта. 26.07.2023
Public Function cstByNameNew(ByVal cstName As String, ByRef db As DAO.Database) As cst
    ' ...............................................................................................................................................
    Dim cstNew As cst, boResult As Boolean
' ---------------------------------------------------------------------------------------------------------------------------------------------------
    Set cstNew = New cst
    ' реинициализируем объект *Стройка* созданием по имени
    cstNew.riByName cstName, boResult, db
    ' объект создался?
    If boResult Then
        ' да, объект создался
        Set cstByNameNew = cstNew
    Else
        ' нет, объект не создался
        Set cstByNameNew = Nothing
    End If
' ---------------------------------------------------------------------------------------------------------------------------------------------------
End Function
' формируем новый объект *Стройка* по имени такого объекта. 26.07.2023. Окончание
' ***************************************************************************************************************************************************
' cst. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' cstAg >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Стройка агента*. 26.07.2023
' ***************************************************************************************************************************************************
' формируем новый объект *Стройка агента* созданием нового, а также объекта *Стройка* по имени и коду агента. 26.07.2023
Public Function cstAgByNameAndAgent(ByVal cstName As String, ByVal agCode As String, ByRef db As DAO.Database) As cstAg
    ' ...............................................................................................................................................
    Dim cstAgNew As cstAg, boResult As Boolean
' ---------------------------------------------------------------------------------------------------------------------------------------------------
    Set cstAgNew = New cstAg
    ' реинициализируем объект *Стройка агента*
    cstAgNew.riByNameAndAgent cstName, agCode, boResult, db
    ' объект создался?
    If boResult Then
        ' да, объект создался
        Set cstAgByNameAndAgent = cstAgNew
    Else
        ' нет, объект не создался
        Set cstAgByNameAndAgent = Nothing
    End If
' ---------------------------------------------------------------------------------------------------------------------------------------------------
End Function
' формируем новый объект *Стройка агента*  созданием нового, а также объекта *Стройка* по имени и коду агента. 26.07.2023. Окончание
' ***************************************************************************************************************************************************

' ***************************************************************************************************************************************************
' формируем новый объект *Стройка агента* по известному ключу. 27.07.2023
Public Function cstAgByKey(ByVal cstAgKey As Long, ByRef db As DAO.Database) As cstAg
    ' ...............................................................................................................................................
    Dim cstAgNew As cstAg, boResult As Boolean
' ---------------------------------------------------------------------------------------------------------------------------------------------------
    Set cstAgNew = New cstAg
    ' реинициализируем объект *Стройка агента*
    cstAgNew.riByKey cstAgKey, boResult, db
    ' объект создался?
    If boResult Then
        ' да, объект создался
        Set cstAgByKey = cstAgNew
    Else
        ' нет, объект не создался
        Set cstAgByKey = Nothing
    End If
' ---------------------------------------------------------------------------------------------------------------------------------------------------
End Function
' формируем новый объект *Стройка агента* по известному ключу. 27.07.2023. Окончание
' ***************************************************************************************************************************************************
' cstAg. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' cstAgPn >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Стройка-Агент-Код*. 09.08.2022
' ***************************************************************************************************************************************************
' формируем объект *Стройка-Агент-Код* по известному ключу такого объекта. 09.08.2022.
Public Function cstAgPnByKey(ByVal cstAgPnKey As Long, ByRef db As DAO.Database) As cstAgPn

    Dim cstAgPnNew As cstAgPn, boResult As Boolean
    
    Set cstAgPnNew = New cstAgPn

    ' реинициализируем объект *Стройка-Агент-Код* по известному ключу такого объекта
    cstAgPnNew.ReinitialiseByKey cstAgPnKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set cstAgPnByKey = cstAgPnNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set cstAgPnByKey = Nothing
    End If

End Function
' формируем объект *Стройка-Агент-Код* по известному ключу такого объекта. 09.08.2022. Окончание
' ***************************************************************************************************************************************************

' ***************************************************************************************************************************************************
' формируем объект *Стройка-Агент-Код* по известному коду такого объекта. 19.09.2022.
Public Function cstAgPnByCode(ByVal cstAgPnCode As String, ByRef db As DAO.Database) As cstAgPn

    Dim cstAgPnNew As cstAgPn, boResult As Boolean
    
    Set cstAgPnNew = New cstAgPn

    ' реинициализируем объект *Стройка-Агент-Код* по известному коду такого объекта
    cstAgPnNew.ReinitialiseByCode cstAgPnCode, boResult, db
    ' имеются ли записи с указанным кодом?
    If boResult Then
        ' да, записи с указанным кодом имеются
        Set cstAgPnByCode = cstAgPnNew
        Else
        ' нет, записи с указанным кодом отсутствуют
        Set cstAgPnByCode = Nothing
    End If

End Function
' формируем объект *Стройка-Агент-Код* по известному коду такого объекта. 19.09.2022. Окончание
' ***************************************************************************************************************************************************

' ***************************************************************************************************************************************************
' формируем объект *Стройка-Агент-Код* созданием нового, а так же новых *Стройки* и *Стройки агента* по имени и коду. 27.07.2023.
Public Function cstAgPnByNameAndCodeNew(ByVal strCstName As String, ByVal strCstAgPn As String, ByRef db As DAO.Database) As cstAgPn

    Dim cstAgPnNew As cstAgPn, boResult As Boolean
    
    Set cstAgPnNew = New cstAgPn

    ' реинициализируем объект *Стройка-Агент-Код* по известному коду такого объекта
    cstAgPnNew.riCstAgPnByNameAndCodeNew strCstName, strCstAgPn, boResult, db
    ' имеются ли записи с указанным кодом?
    If boResult Then
        ' да, записи с указанным кодом имеются
        Set cstAgPnByNameAndCodeNew = cstAgPnNew
        Else
        ' нет, записи с указанным кодом отсутствуют
        Set cstAgPnByNameAndCodeNew = Nothing
    End If

End Function
' формируем объект *Стройка-Агент-Код* созданием нового, а так же новых *Стройки* и *Стройки агента* по имени и коду. 27.07.2023. Окончание
' cstAgPn. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


' ogAg >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Организация-Агент*. 26.07.2023
' ***************************************************************************************************************************************************
' формируем объект *Организация-Агент* по известному коду такого объекта. 26.07.2023
Public Function ogAgByCode(ByVal ogAgCode As String, ByRef db As DAO.Database) As ogAg

    Dim ogAgNew As ogAg, boResult As Boolean
    
    Set ogAgNew = New ogAg

    ' реинициализируем объект *Инвестиционная программа* по известному ключу такого объекта
    ogAgNew.riByCode ogAgCode, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ogAgByCode = ogAgNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ogAgByCode = Nothing
    End If

End Function
' формируем объект *Организация-Агент* по известному коду такого объекта. 26.07.2023. Окончание
' ***************************************************************************************************************************************************
' ogAg. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


' ogAgFee >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Акт агентского вознаграждения*. 06.07.2023
' ***************************************************************************************************************************************************
' формируем объект *Акт агентского вознаграждения* по известному ключу такого объекта. 06.07.2023.
Public Function ogAgFeeByKey(ByVal ogAgFeeKey As Long, ByRef db As DAO.Database) As ogAgFee

    Dim ogAgFeeNew As ogAgFee, boResult As Boolean
    
    Set ogAgFeeNew = New ogAgFee

    ' реинициализируем объект *Инвестиционная программа* по известному ключу такого объекта
    ogAgFeeNew.riByKey ogAgFeeKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ogAgFeeByKey = ogAgFeeNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ogAgFeeByKey = Nothing
    End If

End Function
' формируем объект *Акт агентского вознаграждения* по известному ключу такого объекта. 06.07.2023. Окончание
' ***************************************************************************************************************************************************
' ogAgFee. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' ogAgFeePn >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Акт агентского вознаграждения.Пункт стройки*. 10.07.2023
' ***************************************************************************************************************************************************
' формируем объект *Акт агентского вознаграждения.Пункт стройки* по известному ключу такого объекта. 10.07.2023.
Public Function ogAgFeePnByKey(ByVal ogAgFeePnKey As Long, ByRef db As DAO.Database) As ogAgFeePn

    Dim ogAgFeePnNew As ogAgFeePn, boResult As Boolean
    
    Set ogAgFeePnNew = New ogAgFeePn

    ' реинициализируем объект *Инвестиционная программа* по известному ключу такого объекта
    ogAgFeePnNew.riByKey ogAgFeePnKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ogAgFeePnByKey = ogAgFeePnNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ogAgFeePnByKey = Nothing
    End If

End Function
' формируем объект *Акт агентского вознаграждения.Пункт стройки* по известному ключу такого объекта. 10.07.2023. Окончание
' ***************************************************************************************************************************************************
' ogAgFeePn. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' ipg >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Инвестиционная программа*. 08.08.2022
' ***************************************************************************************************************************************************
' формируем объект *Инвестиционная программа* по известному ключу такого объекта. 08.08.2022.
Public Function ipgByKey(ByVal ipgKey As Long, ByRef db As DAO.Database) As ipg

    Dim ipgNew As ipg, boResult As Boolean
    
    Set ipgNew = New ipg

    ' реинициализируем объект *Инвестиционная программа* по известному ключу такого объекта
    ipgNew.ReinitialiseByKey ipgKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ipgByKey = ipgNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ipgByKey = Nothing
    End If

End Function
' формируем объект *Инвестиционная программа* по известному ключу такого объекта. 08.08.2022. Окончание
' ***************************************************************************************************************************************************
' ipg. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


' ipgPn >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Пункт инвестиционной программы*. 09.08.2022
' ***************************************************************************************************************************************************
' формируем объект *Пункт инвестиционной программы* по известному ключу такого объекта. 09.08.2022.
Public Function ipgPnByKey(ByVal ipgPnKey As Long, ByRef db As DAO.Database) As ipgPn

    Dim ipgPnNew As ipgPn, boResult As Boolean
    
    Set ipgPnNew = New ipgPn

    ' реинициализируем объект *Пункт инвестиционной программы* по известному ключу такого объекта
    ipgPnNew.ReinitialiseByKey ipgPnKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ipgPnByKey = ipgPnNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ipgPnByKey = Nothing
    End If

End Function
' формируем объект *Инвестиционная программа* по известному ключу такого объекта. 09.08.2022. Окончание
' ***************************************************************************************************************************************************
' ipgPn. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' ipgPnLim >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Лимит по направлению затрат для пункта инвестпрограммы*. 09.08.2022
' ***************************************************************************************************************************************************
' формируем объект *Лимит по направлению затрат для пункта инвестпрограммы* по известному ключу такого объекта. 09.08.2022.
Public Function ipgPnLimByKey(ByVal ipgPnLimKey As Long, ByRef db As DAO.Database) As ipgPnLim

    Dim ipgPnLimNew As ipgPnLim, boResult As Boolean
    
    Set ipgPnLimNew = New ipgPnLim

    ' реинициализируем объект *Пункт инвестиционной программы* по известному ключу такого объекта
    ipgPnLimNew.ReinitialiseByKey ipgPnLimKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ipgPnLimByKey = ipgPnLimNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ipgPnLimByKey = Nothing
    End If

End Function
' формируем объект *Инвестиционная программа* по известному ключу такого объекта. 09.08.2022. Окончание
' ***************************************************************************************************************************************************
' ipgPnLim. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


' ipgCh >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Цепочка инвестиционных программ*. 19.09.2022
' ***************************************************************************************************************************************************
' формируем объект *Цепочка инвестиционных программ* по известному ключу такого объекта. 19.09.2022.
Public Function ipgChByKey(ByVal ipgChKey As Long, ByRef db As DAO.Database) As ipgCh

    Dim ipgChNew As ipgCh, boResult As Boolean
    
    Set ipgChNew = New ipgCh

    ' реинициализируем объект *Цепочка инвестиционных программ* по известному ключу такого объекта
    ipgChNew.ReinitialiseByKey ipgChKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ipgChByKey = ipgChNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ipgChByKey = Nothing
    End If

End Function
' формируем объект *Цепочка инвестиционных программ* по известному ключу такого объекта. 19.09.2022. Окончание
' ***************************************************************************************************************************************************
' ipgCh. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' ra >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Отчёт агента*
' ***************************************************************************************************************************************************
' формируем объект *Отчёт агента* по известному ключу такого объекта. 18.07.2022.
Public Function raByKey(ByVal raKey As Long, ByRef db As DAO.Database) As ra

    Dim raNew As ra, boResult As Boolean
    
    Set raNew = New ra

    ' реинициализируем объект *Отчёт агента* по известному ключу такого объекта
    raNew.Class_ReinitialiseByKey raKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set raByKey = raNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set raByKey = Nothing
    End If

End Function
' формируем объект *Отчёт агента* по известному ключу такого объекта. 18.07.2022. Окончание
' ***************************************************************************************************************************************************

' ***************************************************************************************************************************************************
' формируем объект *Отчёт агента* путём создания нового такого объекта. 21.07.2022.
Public Function raCreateNew(ByRef db As DAO.Database, _
    ByVal strRaNum As String, ByVal strRaSign As String, ByVal lngRaPeriod As Long, ByVal lngRaCstAgPn As Long, ByVal lngRaOgSender As Long, _
    ByVal varRaDate As Variant, ByVal varRaWorkType As Variant, _
    ByVal varRaArrv As Variant, ByVal varRaArrvDate As Variant, ByVal varRaArrvDateFact As Variant, _
    ByVal varRaRtnd As Variant, ByVal varRaRtndDate As Variant, ByVal varRaRtndReason As Variant, _
    ByVal varRaSent As Variant, ByVal varRaSentDate As Variant, _
    ByVal varRaNoteT As Variant, ByVal varRaNote As Variant) As ra

    Dim raNew As ra, boResult As Boolean
    
    Set raNew = New ra

    ' реинициализируем объект *Отчёт агента* путём создания нового такого объекта
    raNew.Class_ReinitialiseCreateNew boResult, db, _
        strRaNum, strRaSign, lngRaPeriod, lngRaCstAgPn, lngRaOgSender, _
        varRaDate, varRaWorkType, _
        varRaArrv, varRaArrvDate, varRaArrvDateFact, _
        varRaRtnd, varRaRtndDate, varRaRtndReason, _
        varRaSent, varRaSentDate, _
        varRaNoteT, varRaNote
    ' имеется ли новый объект?
    If boResult Then
        ' да, новый объект имеется
        Set raCreateNew = raNew
        Else
        ' нет, новый объект отсутствует
        Set raCreateNew = Nothing
    End If

End Function
' формируем объект *Отчёт агента* путём создания нового такого объекта. 21.07.2022. Окончание
' ***************************************************************************************************************************************************
' ra. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' raSm >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Сумма отчёта агента*
' ***************************************************************************************************************************************************
' формируем объект *Сумма отчёта агента* по известному ключу такого объекта. 20.07.2022
Public Function raSmByKey(ByVal raSmKey As Long, ByRef db As DAO.Database) As raSm

    Dim raSmNew As raSm, boResult As Boolean
    
    Set raSmNew = New raSm

    ' реинициализируем объект *Сумма отчёта агента* по известному ключу такого объекта
    raSmNew.Class_ReinitialiseByKey raSmKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set raSmByKey = raSmNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set raSmByKey = Nothing
    End If

End Function
' формируем объект *Сумма отчёта агента* по известному ключу такого объекта. 20.07.2022. Окончание
' ***************************************************************************************************************************************************

' ***************************************************************************************************************************************************
' формируем объект *Сумма отчёта агента* путём создания такого объекта. 20.07.2022
Public Function raSmCreateNew(ByVal raKey As Long, db As DAO.Database, _
    ByVal varTtl As Variant, ByVal varWork As Variant, ByVal varEquip As Variant, ByVal varOthers As Variant) As raSm

    Dim raSmNew As raSm, boResult As Boolean
    
    Set raSmNew = New raSm

    ' реинициализируем объект *Сумма отчёта агента* путём создания такого объекта
    raSmNew.Class_ReinitialiseCreateNew raKey, boResult, db, varTtl, varWork, varEquip, varOthers
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set raSmCreateNew = raSmNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set raSmCreateNew = Nothing
    End If

End Function
' формируем объект *Сумма отчёта агента* путём создания такого объекта. 20.07.2022. Окончание
' ***************************************************************************************************************************************************
' класс *Сумма отчёта агента*. Окончание
' raSm. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>




' rc >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Изменение отчёта агента*
' ***************************************************************************************************************************************************
' формируем объект *Изменение отчёта агента* по известному ключу такого объекта. 22.07.2022.
Public Function rcByKey(ByVal rcKey As Long, ByRef db As DAO.Database) As rc

    Dim rcNew As rc, boResult As Boolean
    
    Set rcNew = New rc

    ' реинициализируем объект *Изменение отчёта агента* по известному ключу такого объекта
    rcNew.Class_ReinitialiseByKey rcKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set rcByKey = rcNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set rcByKey = Nothing
    End If

End Function
' формируем объект *Изменение отчёта агента* по известному ключу такого объекта. 22.07.2022. Окончание
' ***************************************************************************************************************************************************

' ***************************************************************************************************************************************************
' формируем объект *Отчёт агента* путём создания нового такого объекта. 21.07.2022.
Public Function rcCreateNew(ByRef db As DAO.Database, _
    ByVal lngRcRa As Long, ByVal intRcNum As Integer, ByVal lngRcPeriod As Long, ByVal lngRcOgSender As Long, _
    ByVal varRcDate As Variant, _
    ByVal varRaArrv As Variant, ByVal varRaArrvDate As Variant, ByVal varRaArrvDateFact As Variant, _
    ByVal varRaRtnd As Variant, ByVal varRaRtndDate As Variant, ByVal varRaRtndReason As Variant, _
    ByVal varRaSent As Variant, ByVal varRaSentDate As Variant, _
    ByVal varRaNoteT As Variant, ByVal varRaNote As Variant) As rc

    Dim rcNew As rc, boResult As Boolean

    Set rcNew = New rc

    ' реинициализируем объект *Отчёт агента* путём создания нового такого объекта
    rcNew.Class_ReinitialiseCreateNew boResult, db, _
        lngRcRa, intRcNum, lngRcPeriod, lngRcOgSender, _
        varRcDate, _
        varRaArrv, varRaArrvDate, varRaArrvDateFact, _
        varRaRtnd, varRaRtndDate, varRaRtndReason, _
        varRaSent, varRaSentDate, _
        varRaNoteT, varRaNote
    ' имеется ли новый объект?
    If boResult Then
        ' да, новый объект имеется
        Set rcCreateNew = rcNew
        Else
        ' нет, новый объект отсутствует
        Set rcCreateNew = Nothing
    End If

End Function
' формируем объект *Отчёт агента* путём создания нового такого объекта. 21.07.2022. Окончание
' ***************************************************************************************************************************************************
' класс *Изменение отчёта агента*. Окончание
' rc. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


' rcSm >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Сумма изменения отчёта агента*
' ***************************************************************************************************************************************************
' формируем объект *Сумма изменения отчёта агента* по известному ключу такого объекта. 22.07.2022
Public Function rcSmByKey(ByVal rcSmKey As Long, ByRef db As DAO.Database) As rcSm

    Dim rcSmNew As rcSm, boResult As Boolean
    
    Set rcSmNew = New rcSm

    ' реинициализируем объект *Сумма изменения отчёта агента* по известному ключу такого объекта
    rcSmNew.Class_ReinitialiseByKey rcSmKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set rcSmByKey = rcSmNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set rcSmByKey = Nothing
    End If

End Function
' формируем объект *Сумма изменения отчёта агента* по известному ключу такого объекта. 22.07.2022. Окончание
' ***************************************************************************************************************************************************

' ***************************************************************************************************************************************************
' формируем объект *Сумма изменения отчёта агента* путём создания такого объекта. 20.07.2022
Public Function rcSmCreateNew(ByVal rcKey As Long, db As DAO.Database, _
    ByVal varTtl As Variant, ByVal varWork As Variant, ByVal varEquip As Variant, ByVal varOthers As Variant) As rcSm

    Dim rcSmNew As rcSm, boResult As Boolean

    Set rcSmNew = New rcSm

    ' реинициализируем объект *Сумма отчёта агента* путём создания такого объекта
    rcSmNew.Class_ReinitialiseCreateNew rcKey, boResult, db, varTtl, varWork, varEquip, varOthers
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set rcSmCreateNew = rcSmNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set rcSmCreateNew = Nothing
    End If

End Function
' формируем объект *Сумма изменения отчёта агента* путём создания такого объекта. 20.07.2022. Окончание
' ***************************************************************************************************************************************************
' класс *Сумма изменения отчёта агента*. Окончание
' rcSm. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>



' Ra_a >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' формируем объект ревизии по известному ключу такого объекта
Public Function Ra_aReadKey(ByVal ra_a As Long, ByRef db As DAO.Database, Optional ByRef ra_aResult As TextBox = Nothing) As ra_a

    Dim Ra_aNew As ra_a, boResult As Boolean
    
    Set Ra_aNew = New ra_a

    ' реинициализируем объект *Ревизия отчётов агента* по известному ключу такого объекта
    Ra_aNew.riRa_aReadKey ra_a, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        If Not ra_aResult Is Nothing Then
            Set Ra_aNew.obgRa_aResult = ra_aResult
        End If
        Set Ra_aReadKey = Ra_aNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set Ra_aReadKey = Nothing
    End If

End Function
' Ra_a. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' ra_aAllAgents >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Ревизия отчётов агента. Проверка файла Отчётов всех агентов*
' формируем объект *Ревизия отчётов агента. Проверка файла Отчётов всех агентов* по известному ключу такого объекта. 06.07.2022. ********************
Public Function ra_aAllAgentsReadKey(ByVal ra_aAllAgents As Long, ByRef objParent As ra_a, ByRef db As DAO.Database) As ra_aAllAgents

    Dim ra_aAllAgentsNew As ra_aAllAgents, boResult As Boolean
    
    Set ra_aAllAgentsNew = New ra_aAllAgents

    ' реинициализируем объект *Ревизия отчётов агента. Проверка файла Отчётов всех агентов* по известному ключу такого объекта
    ra_aAllAgentsNew.riRa_aAllAgentReadKey ra_aAllAgents, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ra_aAllAgentsNew.parent = objParent
        Set ra_aAllAgentsReadKey = ra_aAllAgentsNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ra_aAllAgentsReadKey = Nothing
    End If

End Function
' формируем объект *Ревизия отчётов агента. Проверка файла Отчётов всех агентов* по известному ключу такого объекта. 06.07.2022. Окончание **********
' ra_aAllAgents. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


' ra_aAgFee23_06 >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Ревизия ОА. Проверка файла Актов агентского вознаграждения*
' ***************************************************************************************************************************************************
' формируем объект *Ревизия ОА. Проверка файла Актов агентского вознаграждения* по известному ключу такого объекта. 29.06.2023
Public Function ra_aAgFee23_06ByKey(ByVal Ra_aAgFee23_06Key As Long, ByRef objParent As ra_a, ByRef db As DAO.Database) As ra_aAgFee23_06

    Dim ra_aAgFee23_06New As ra_aAgFee23_06, boResult As Boolean
    
    Set ra_aAgFee23_06New = New ra_aAgFee23_06

    ' реинициализируем объект *Ревизия отчётов агента. Проверка файла Отчётов всех агентов* по известному ключу такого объекта
    ra_aAgFee23_06New.riByKey Ra_aAgFee23_06Key, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set ra_aAgFee23_06New.parent = objParent
        Set ra_aAgFee23_06ByKey = ra_aAgFee23_06New
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set ra_aAgFee23_06ByKey = Nothing
    End If

End Function
' ***************************************************************************************************************************************************
' формируем объект *Ревизия ОА. Проверка файла Актов агентского вознаграждения* по известному ключу такого объекта. 29.06.2023. Окончание
' ra_aAgFee23_06. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


' stCost >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Пункт структуры затрат*. 09.08.2022
' ***************************************************************************************************************************************************
' формируем объект *Пункт структуры затрат* по известному ключу такого объекта. 09.08.2022.
Public Function stCostByKey(ByVal stCostKey As Long, ByRef db As DAO.Database) As stCost

    Dim stCostNew As stCost, boResult As Boolean
    
    Set stCostNew = New stCost

    ' реинициализируем объект *Пункт структуры затрат* по известному ключу такого объекта
    stCostNew.ReinitialiseByKey stCostKey, boResult, db
    ' имеются ли записи с указанным ключём?
    If boResult Then
        ' да, записи с указанным ключём имеются
        Set stCostByKey = stCostNew
        Else
        ' нет, записи с указанным ключём отсутствуют
        Set stCostByKey = Nothing
    End If

End Function
' формируем объект *Пункт структуры затрат* по известному ключу такого объекта. 09.08.2022. Окончание
' ***************************************************************************************************************************************************
' stCost. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>

' dbAccess >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
' класс *Работа с базой данных Access*. 15.09.2022
' ***************************************************************************************************************************************************
' формируем объект *Работа с базой данных Access* по базе данных. 15.09.2022.
Public Function dbAccessByDB(ByRef db As DAO.Database) As dbAccess

    Dim dbAccessNew As dbAccess
    
    Set dbAccessNew = New dbAccess

    ' реинициализируем объект *Работа с базой данных Access* по базе данных
    dbAccessNew.Reinitialise db
    
    Set dbAccessByDB = dbAccessNew
    
End Function
' формируем объект *Работа с базой данных Access* по базе данных. 15.09.2022. Окончание
' ***************************************************************************************************************************************************
' dbAccess. Окончание >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>


' вносим значение в строковое поле 28.03.2022. ******************************************************************************************************
Public Sub fieldInsertString(ByRef FieldIns As DAO.Field, ByVal StringIns As Variant)

    Const cstrTitle As String _
        = "Процедура *Вносим значение в строковое поле*"
        
    '**************************************************************************************************************************************
    
On Error GoTo ErrHandler

    If IsNull(StringIns) = False And IsEmpty(StringIns) = False _
        And Not StringIns = "" Then
        FieldIns = StringIns
    Else
        'FieldIns = Null
    End If
                            
NormalExit:
    Exit Sub
    
ErrHandler:
    MsgBox Err.Description & vbCrLf & "Error number: " & Err.Number & vbCrLf & cstrTitle, vbExclamation, cstrTitle
    Resume NormalExit
                            
End Sub
' вносим значение в строковое поле 28.03.2022. Окончание ********************************************************************************************


